test/performance/OffersMs.yml
config:
  payload:
    path: "dataset.csv"
    skipHeader: true
    fields:
      - "offerId"
  target: 'http://localhost:3001/api/offers'
  phases:
    - duration: 5
      arrivalRate: 10
scenarios:
  - flow:
    - get:
        url: "/{{ offerId }}"
        name: "get offer by id"
    - get:
        url: "/"
        name: "search offers by product name"
        qs:
          search: "PRODUCT"